# Data Frame Manipulation

In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')

raw_labels = ['Raju','Pandey','Srini','Sunil','Ashok']

column_headings = ['Age','Height','Weight']

In [3]:
df =pd.DataFrame(data=matrix_data, index=raw_labels, columns=column_headings)

print('\n A new DataFrame \n','-'*50,sep='')

print(df)

 A new DataFrame
--------------------------------------------------
        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [4]:
print('\n The height column\n','-'*50,sep='')

print(df['Height'])

 The height column
--------------------------------------------------
Raju      66
Pandey    70
Srini     62
Sunil     68
Ashok     62
Name: Height, dtype: int32

In [5]:
print('\n The height & Weight columns indexed by passing a list\n','-'*50,sep='')

print(df[['Height','Weight']])

 The height & Weight columns indexed by passing a list
--------------------------------------------------
        Height  Weight
Raju        66     140
Pandey      70     148
Srini       62     125
Sunil       68     160
Ashok       62     152

In [6]:
only_ht_wt =df[['Height','Weight']]

In [7]:
only_ht_wt

        Height  Weight
Raju        66     140
Pandey      70     148
Srini       62     125
Sunil       68     160
Ashok       62     152

In [8]:
print('\n The "Age" column accessed by DON method (NOT RECOMMENDED) \n','-'*50 ,sep ='')
print (df.Age)   # You can access only one column at a time

 The "Age" column accessed by DON method (NOT RECOMMENDED)
--------------------------------------------------
Raju      22
Pandey    42
Srini     30
Sunil     35
Ashok     25
Name: Age, dtype: int32

#### Let's Understand slicing particular element

In [9]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [10]:
df.loc['Raju']

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [11]:
df.iloc[0]

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [12]:
print(df)

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

## let's understand slicing perticular element

In [13]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [14]:
# seleccted particular index data using loc(index name)
df.loc['Raju']

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [21]:
print('\n Select Index and column for a particular data  \n')
print(df.loc['Pandey','Height'])

 Select Index and column for a particular data

70

In [22]:
print('Select index and list of columns data\n')
print(df.loc['Ashok',['Height','Weight']])

Select index and list of columns data

Height     62
Weight    152
Name: Ashok, dtype: int32

In [25]:
print('Select list of index and columns data \n')
print(df.loc[['Srini','Sunil'],['Height','Weight']])

Select list of index and columns data

       Height  Weight
Srini      62     125
Sunil      68     160

In [24]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

## select data on condition

In [15]:
print("\n Rows with Height > 65 inch \n",'-'*35,sep='')
print(df[df['Height']>65])

 Rows with Height > 65 inch
-----------------------------------
        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Sunil    35      68     160

In [16]:
booldf1 =df['Height']>65
booldf2 = df['Weight']>145

In [17]:
print("\n Rows with Height > 65 inch and Weight >145 lbs \n",'-'*55,sep = '')
print(df[(booldf1) & (booldf2)])

 Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
        Age  Height  Weight
Pandey   42      70     148
Sunil    35      68     160

In [18]:
print("\n DataFrame with only Age and Weight columns whose Height > 65 inch \n",'-'*50,sep ='')
print(df[booldf1][['Age','Weight']])

 DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------
        Age  Weight
Raju     22     140
Pandey   42     148
Sunil    35     160

In [19]:
selected_candidates = df[booldf1][['Age','Weight']]

In [20]:
print (selected_candidates)

        Age  Weight
Raju     22     140
Pandey   42     148
Sunil    35     160

In [26]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [27]:
print('\n After resetting index\n','-'*50,sep='')
print(df.reset_index())

 After resetting index
--------------------------------------------------
    index  Age  Height  Weight
0    Raju   22      66     140
1  Pandey   42      70     148
2   Srini   30      62     125
3   Sunil   35      68     160
4   Ashok   25      62     152

In [28]:
print("\n After resetting index with 'drop' option TRUE\n ",'-'*50,sep='')
print(df.reset_index(drop = True))

 After resetting index with 'drop' option TRUE
 --------------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [34]:
print("\n Adding a new column 'Profession' \n",'-'*50,sep ='')
df['Profession'] = "Student  Teacher  Engineer  Assistant  Software".split()
print(df)

 Adding a new column 'Profession'
--------------------------------------------------
        Age  Height  Weight Profession
Raju     22      66     140    Student
Pandey   42      70     148    Teacher
Srini    30      62     125   Engineer
Sunil    35      68     160  Assistant
Ashok    25      62     152   Software

In [35]:
print("\n Setting 'Profession ' column as index\n",'-'*50,sep ='')
print(df.set_index('Profession'))

 Setting 'Profession ' column as index
--------------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Assistant    35      68     160
Software     25      62     152